app/Controllers/Admin.php

    public function dashboard()
    {
        // if (!$this->session->get('logged_in')) {
        //     return redirect()->to('/admin/login');
        // }

        // récupération des données pour afficher les réservations de logement.
        $reservations = $this->reservationModel->where('status', 'confirmed')->findAll();
        $reservationsUsers = [];
        foreach ($reservations as $reservation) {
            // Récupérez l'utilisateur correspondant à l'ID de l'utilisateur de la réservation
            $user = $this->users->find($reservation['userId']);
            // Ajoutez l'utilisateur à la réservation
            $reservation['user'] = $user;
            // Ajoutez la réservation avec l'utilisateur au tableau
            $reservationsUsers[] = $reservation;
        }
        $data['reservations'] = $reservationsUsers;

        $reservationsCancel = $this->reservationModel->where('status', 'cancel')->findAll();
        $reservationsCancelUsers = [];
        foreach ($reservationsCancel as $reservation) {
            // Récupérez l'utilisateur correspondant à l'ID de l'utilisateur de la réservation
            $user = $this->users->find($reservation['userId']);
---
SELECT *
FROM `reservation`
WHERE `status` != 'refuse'
AND `status` != 'cancel'
AND `status` != 'change'
SELECT *
FROM `users`
WHERE `users`.`id` = '12'
SELECT *
FROM `reservation`
WHERE `status` IN ('cancel','refuse')

        }
        $data['reservationsCancel'] = $reservationsCancelUsers;

        // récupération des données pour afficher les réservations de materiel.
        $reservationMateriels = $this->reservationMaterielModel->where('status', 'confirmed')->findAll();
        $reservationsMaterielUsers = [];
        foreach ($reservationMateriels as $reservationMateriel) {
            // Récupérez l'utilisateur correspondant à l'ID de l'utilisateur de la réservation
            $user = $this->users->find($reservationMateriel['user_id']);
            $materielModel = $this->materielModel->find($reservationMateriel['materiel_id']);
---
SELECT *
FROM `reservation_materiel`
WHERE `status` != 'refuse'
AND `status` != 'cancel'
SELECT *
FROM `users`
WHERE `users`.`id` = '12'
SELECT *
FROM `materiel`
WHERE `materiel`.`id` = '1'

        }
        $data['reservationMateriels'] = $reservationsMaterielUsers;

        $reservationMaterielCancels = $this->reservationMaterielModel->where('status', 'cancel')->findAll();
        $reservationMaterielCancelUsers = [];
        foreach ($reservationMaterielCancels as $reservationMateriel) {
            // Récupérez l'utilisateur correspondant à l'ID de l'utilisateur de la réservation
            $user = $this->users->find($reservationMateriel['user_id']);
            $materielModel = $this->materielModel->find($reservationMateriel['materiel_id']);
---
SELECT *
FROM `reservation_materiel`
WHERE `status` IN ('cancel','refuse')
SELECT *
FROM `users`
WHERE `users`.`id` = '12'
SELECT *
FROM `materiel`
WHERE `materiel`.`id` = '1'

    public function deleteReservation($reservationId)
    {
        $this->reservationModel->delete($reservationId);
---
DELETE FROM `reservation`
WHERE `id` IN ('35')