app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `mail` = 'admin77420@gmail.com'
 LIMIT 1
---
    public function login()
    {
        if ($this->request->getMethod() === 'post') {
            $data = $this->request->getPost();

            $userModel = new \App\Models\Users();
            $user = $userModel->where('mail', $data['mail'])->first();