app/Controllers/Logement.php

    public function view(): string
    {
        // Charger la vue de la page logements et passer les données
        $data['logements'] = [];
        $data['nbr_logement_type1'] = 0;
        $data['nbr_logement_type2'] = 0;
        $data['nbr_logement_type3'] = 0;
        $data['nbr_logement_type4'] = 0;
        $data['nbr_logement_type5'] = 0;

        // Récupérer les logements de chaque catégorie et compter le nombre de logements pour chaque catégorie
        // Filtrer les logements par catégorie et par réservation
        $logements1 = $this->logementModel->where('categorie', 1)->where('reserver', 0)->findAll();
        $data['logements'][1] = $logements1;
        $data['nbr_logement_type1'] = count($logements1);

        $logements2 = $this->logementModel->where('categorie', 2)->where('reserver', 0)->findAll();
        $data['logements'][2] = $logements2;
        $data['nbr_logement_type2'] = count($logements2);

        $logements3 = $this->logementModel->where('categorie', 3)->where('reserver', 0)->findAll();
        $data['logements'][3] = $logements3;
        $data['nbr_logement_type3'] = count($logements3);

        $logements4 = $this->logementModel->where('categorie', 4)->where('reserver', 0)->findAll();
        $data['logements'][4] = $logements4;
        $data['nbr_logement_type4'] = count($logements4);

        $logements5 = $this->logementModel->where('categorie', 5)->where('reserver', 0)->findAll();
---
SELECT *
FROM `logement`
WHERE `categorie` = 1
AND `reserver` = 0
SELECT *
FROM `logement`
WHERE `categorie` = 2
AND `reserver` = 0
SELECT *
FROM `logement`
WHERE `categorie` = 3
AND `reserver` = 0
SELECT *
FROM `logement`
WHERE `categorie` = 4
AND `reserver` = 0
SELECT *
FROM `logement`
WHERE `categorie` = 5
AND `reserver` = 0

    public function type1(): string
    {
        $logements1 = $this->logementModel->where('categorie', 1)->where('reserver', 0)->findAll();
---
SELECT *
FROM `logement`
WHERE `categorie` = 1
AND `reserver` = 0

    public function type2(): string
    {
        $logements2 = $this->logementModel->where('categorie', 2)->where('reserver', 0)->findAll();
---
SELECT *
FROM `logement`
WHERE `categorie` = 3
AND `reserver` = 0

                    'userId' => $userSession['id']
                ];

                $this->reservationModel->insert($reservationData);
---
INSERT INTO `reservation` (`dateDebut`, `dateFin`, `nbrPersonne`, `prix`, `userId`) VALUES ('2024-04-20', '2024-04-21', '4', 100.28, '5')



                // Mettre à jour la colonne reserver de la table logement à true
                $this->logementModel->update($id, ['reserver' => 1]);
---
UPDATE `logement` SET `reserver` = 1
WHERE `logement`.`id` IN ('A101')