app/Controllers/Materiel.php

SELECT *
FROM `materiel`
WHERE `categorie` = 'informatique'
AND `reserver` = 0
SELECT *
FROM `materiel`
WHERE `categorie` = 'imprimante'
AND `reserver` = 0
SELECT *
FROM `materiel`
WHERE `categorie` = 'internet'
AND `reserver` = 0
SELECT *
FROM `materiel`
WHERE `categorie` = 'video'
AND `reserver` = 0
SELECT *
FROM `materiel`
WHERE `categorie` = 'photocopieur'
AND `reserver` = 0
SELECT *
FROM `materiel`
WHERE `categorie` = 'accessoire'
AND `reserver` = 0
---
    public function index()
    {

        $data['materiels'] = [];
        $data['nbr_materiel_type1'] = 0;

        $materiel1 = $this->materielModel->where('categorie', 'informatique')->where('reserver', 0)->findAll();
        $data['materiels']['categorie'] = $materiel1;
        $data['nbr_materiel_type1'] = count($materiel1);

        $materiel2 = $this->materielModel->where('categorie', 'imprimante')->where('reserver', 0)->findAll();
        $data['materiels']['imprimante'] = $materiel2;
        $data['nbr_materiel_type2'] = count($materiel2);

        $materiel3 = $this->materielModel->where('categorie', 'internet')->where('reserver', 0)->findAll();
        $data['materiels']['internet'] = $materiel3;
        $data['nbr_materiel_type3'] = count($materiel3);

        $materiel4 = $this->materielModel->where('categorie', 'video')->where('reserver', 0)->findAll();
        $data['materiels']['video'] = $materiel4;
        $data['nbr_materiel_type4'] = count($materiel4);

        $materiel5 = $this->materielModel->where('categorie', 'photocopieur')->where('reserver', 0)->findAll();
        $data['materiels']['photocopieur'] = $materiel5;
        $data['nbr_materiel_type5'] = count($materiel5);

        $materiel6 = $this->materielModel->where('categorie', 'accessoire')->where('reserver', 0)->findAll();
        $data['materiels']['accessoire'] = $materiel6;
        $data['nbr_materiel_type6'] = count($materiel6);

        $materiel7 = $this->materielModel->where('categorie', 'transmission')->where('reserver', 0)->findAll();

SELECT *
FROM `materiel`
WHERE `categorie` = 'imprimante'
AND `reserver` = 0
---
    public function type2() : string{
        $materiel2 = $this->materielModel->where('categorie', 'imprimante')->where('reserver', 0)->findAll();

SELECT *
FROM `materiel`
WHERE `categorie` = 'internet'
AND `reserver` = 0
---
    public function type3() : string{
        $materiel3 = $this->materielModel->where('categorie', 'internet')->where('reserver', 0)->findAll();

SELECT *
FROM `materiel`
WHERE `categorie` = 'transmission'
AND `reserver` = 0
---
    public function type7() : string{
        $materiel7 = $this->materielModel->where('categorie', 'transmission')->where('reserver', 0)->findAll();

SELECT *
FROM `materiel`
WHERE `materiel`.`id` = '4'
---
    public function reserveMateriel($id)
    {
        $materiel = $this->materielModel->find($id);