app/Controllers/Users.php

    public function profil($id): string
    {
        $data['reservations'] = $this->reservationModel->where('status !=', 'cancel')->where('status !=', 'change')->where('userId', $id)->findAll();

        // récupération des données pour afficher les réservations de materiel.
        $reservationMateriels = $this->reservationMaterielModel->where('status !=', 'cancel')->where('user_id', $id)->findAll();
        $reservationsMaterielDetails = [];
        foreach ($reservationMateriels as $reservationMateriel) {
            $materielModel = $this->materielModel->find($reservationMateriel['materiel_id']);
---
SELECT *
FROM `reservation`
WHERE `status` != 'cancel'
AND `userId` = '12'
SELECT *
FROM `reservation_materiel`
WHERE `status` != 'cancel'
AND `user_id` = '14'
SELECT *
FROM `materiel`
WHERE `materiel`.`id` = '6'