app/Models/logementModel.php

    public function getLogementById($id)
    {
        // Utilisez la méthode find() pour récupérer le logement par son identifiant.
        return $this->find($id);
---
SELECT *
FROM `logement`
WHERE `logement`.`id` = 'A101'