app/Models/logementModel.php

    public function countCategory1() { return $this->db->table('logement')->where('categorie', 1)->countAllResults(); }
    public function countCategory2() { return $this->db->table('logement')->where('categorie', 2)->countAllResults(); }
    public function countCategory3() { return $this->db->table('logement')->where('categorie', 3)->countAllResults(); }
    public function countCategory4() { return $this->db->table('logement')->where('categorie', 4)->countAllResults(); }
    public function countCategory5() { return $this->db->table('logement')->where('categorie', 5)->countAllResults(); }
---
SELECT COUNT(*) AS `numrows`
FROM `logement`
WHERE `categorie` = 1
SELECT COUNT(*) AS `numrows`
FROM `logement`
WHERE `categorie` = 2
SELECT COUNT(*) AS `numrows`
FROM `logement`
WHERE `categorie` = 3
SELECT COUNT(*) AS `numrows`
FROM `logement`
WHERE `categorie` = 4
SELECT COUNT(*) AS `numrows`
FROM `logement`
WHERE `categorie` = 5